1 - запомянне на предишно състояние на функция
2 - можем да се върнем до това състоя ние и до всичките по-долни по всяко време когато ни потрябват
3 - функция от по-висок ред е функция, която може да приема други функции като нейн аргумент
4 - filter, sort, map
5 - За да може една функция да е pure, тя трябва да изпълнява две условия:
    1 -> тя връща всеки път при едни и същи аргументи еднакъв резултат 
    2 -> не е възможно да бъде модифицирана от съншния свят
6 - възможността за заключване на нещо от външния свят, така че то да не може да бъде променяно след неговото създаване
7 - взимане на много аргументи и разпределянето им по други функции
8 - 1 -> написано какво да се направи, а не как да се направи 
    2 -> винаги връщащ едини и същ изход при един и същ вход
    3 -> непроменяем